import random

exam_questions_and_answers = {
    "1. Донаучный и научный этапы развития лингвистики. Проблема периодизации науки и критерии научности.": "",
    "2. История развития лингвистики как смена научных парадигм. Сравнительно-историческая, системно-структурная, генеративная парадигмы в истории языкознаяния.": "",
    "3. Парадигмальные черты современной лингвистики. Антропоцентризм, экспансионизм, эспланаторность, функционализм. Основные направления и области исследования современного языкознаяния": "",
    "4. Картина мира и её объективация в языке. Научная картина мира VS художественная картина мира.": "",
    "5. Когнитивная лингвистика как одно из ведущих направлений в развитии современного языкознания. Изучение категоризации: структура категории и уровни категоризации (исследования Р. Брауна, Э. Рош, Дж. Лакоффа, Б. Хокинса и др.)": "",
    "6. Текст как антропомерная система конститутивных свойств (категорий). Категориальная модель текстапо Р. де Богранду и В. Дресслеру.": "",
    "7. Текст в системе гуманитарных наук. Актуальность междисциплинарных исследований текста.": "",
    "8. Категория адресованности в художественном и научном тексте.": "",
    "9. Этические нормы науки и их реализация в научном тексте. Понятие <<научного сообщества>>.": "",
    "10. Особенности научного творчества, его виды и этапы творческого процесса.": "",
    "11. Искусственные языки, их назначение и принципы.": "",
    "12. Языковая вариантивность в свете теории мировых вариантов английского языка (World Englishes Paradigm).": "",
    "13. Стереотипы в межкультурной коммуникации, их виды, функции и отражения в языке.": "",
    "14. Модель освоения чужой культуры и развития мужкультурной компетенции по М. Беннету. Этноцентризм VS этнорелятивизм в МКК.": "",
    "15. Корпусный подход в современной лингвистике: характеристика основных лингвистичесиких корпусов и возможности их использования в разных областях.": "",
}
